class Ex03_DataType {

	public static void main(String[] args) {

		//Ex03_DataType.java

		/*

		DataType, 자료형
		- 데이터의 형태와 길이를 정의
		
		자바의 자료형
		1. 원시형(Primitive Type), 기본형, 값형(Value Type)
			a. 숫자형
				1. 정수형
					a. byte
					b. short
					c. int
					d. long
				2. 실수형
					a. float 거의 무한대라고 생각하믄 됨 
					b. double
			b. 문자형
				1. 문자형
					a.char
					- 65라는 숫자가 들어있다고 치자 
					0000000001000001->65=A 면 66엔 B할당하는게 편하겠지 그렇게따지면 ABCD는 사람이 아는연속성이지만 숫자도 나름 연속성이 있지
					65라는 숫자는 문자코드값 이거 나중에 나름 써먹음 
					아스키랑 유니코드에서 다 A는 65 
					'가'는 나중에 생겼으니까 후반부에 위치한다
					
					
					****CHAR책에는 정수형으로 취급 왜냐면 A는 65니까****


					
			c. 논리형
				1. 논리형
					a.boolean(불리언, 불)


		2. 참조형(Reference Type)


		- 100 (숫자)
		- 홍길동 (문자)


		변수
		1. 500명 10과목이라고 치자 5000개의 주소를 기억해야한다.
			어케아러 번지 의미도 없는데 100이랑101이랑
			공간할당받을때 이름 붙일수가 있다.
			공간을 얻어내면 주소를 기억하는게 아니라 이름을 기억하자 이름이 붙여진 이 공간자체를 변수라고 한다.

		변수(변하는 수) <->상수(변하지 않는 수) *숫자만 말하는 거X, 문자까지 포함
		10+20
		.
		.
		.
		.
		10X2
		10은 그대로, 표현이 바뀌지 않으면 데이터의 성질도 변하지 않는다. ->상수

		표현의 방식은그대론데 그안에 있는 값이 변했다->변수
		KOR=100, KORX2-> 100X2
		KOR=200, KORX2-> 200X2 
		KOR은 그대론데 그안에 숫자가 100->200으로 변했다. 









		*/


	}

}
